QX-C2000-DSP/f280049revb_evb_examples/examples_core0/examples/adc/adc_ex4_soc_software_sync/board.h

#ifndef BOARD_H
#define BOARD_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C" {
#endif

//
// Included Files
//

#include "driverlib.h"
#include "device.h"

//*****************************************************************************
//
// PinMux Configurations
//
//*****************************************************************************
//
// GPIO0 - GPIO Settings
//
#define myGPIO0_GPIO_PIN_CONFIG GPIO_0_GPIO0

//*****************************************************************************
//
// ADC Configurations
//
//*****************************************************************************
#define myADC0_BASE                ADCA_BASE
#define myADC0_RESULT_BASE         ADCARESULT_BASE
#define myADC0_SOC0                ADC_SOC_NUMBER0
#define myADC0_FORCE_SOC0          ADC_FORCE_SOC0
#define myADC0_SAMPLE_WINDOW_SOC0  80
#define myADC0_TRIGGER_SOURCE_SOC0 ADC_TRIGGER_GPIO
#define myADC0_CHANNEL_SOC0        ADC_CH_ADCIN2
#define myADC0_SOC1                ADC_SOC_NUMBER1
#define myADC0_FORCE_SOC1          ADC_FORCE_SOC1
#define myADC0_SAMPLE_WINDOW_SOC1  80
#define myADC0_TRIGGER_SOURCE_SOC1 ADC_TRIGGER_GPIO
#define myADC0_CHANNEL_SOC1        ADC_CH_ADCIN3
void myADC0_init();

#define myADC1_BASE                ADCC_BASE
#define myADC1_RESULT_BASE         ADCCRESULT_BASE
#define myADC1_SOC0                ADC_SOC_NUMBER0
#define myADC1_FORCE_SOC0          ADC_FORCE_SOC0
#define myADC1_SAMPLE_WINDOW_SOC0  80
#define myADC1_TRIGGER_SOURCE_SOC0 ADC_TRIGGER_GPIO
#define myADC1_CHANNEL_SOC0        ADC_CH_ADCIN2
#define myADC1_SOC1                ADC_SOC_NUMBER1
#define myADC1_FORCE_SOC1          ADC_FORCE_SOC1
#define myADC1_SAMPLE_WINDOW_SOC1  80
#define myADC1_TRIGGER_SOURCE_SOC1 ADC_TRIGGER_GPIO
#define myADC1_CHANNEL_SOC1        ADC_CH_ADCIN3
void myADC1_init();

//*****************************************************************************
//
// ASYSCTL Configurations
//
//*****************************************************************************

//*****************************************************************************
//
// GPIO Configurations
//
//*****************************************************************************
#define myGPIO0 0
void myGPIO0_init();

//*****************************************************************************
//
// INPUTXBAR Configurations
//
//*****************************************************************************
#define myINPUTXBARINPUT0_SOURCE 0
#define myINPUTXBARINPUT0_INPUT  XBAR_INPUT5
void myINPUTXBARINPUT0_init();

//*****************************************************************************
//
// Board Configurations
//
//*****************************************************************************
void Board_init();
void ADC_init();
void ASYSCTL_init();
void GPIO_init();
void INPUTXBAR_init();
void PinMux_init();

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // end of BOARD_H definition
